Revit 2024 API
FabricSheet.GetWireCenterlines Method (WireDistributionDirection)
 Gets a list of curves representing the wires centerlines of the Fabric Sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<Curve> GetWireCenterlines(
	WireDistributionDirection wireDirection
)
Visual Basic
Public Function GetWireCenterlines ( _
	wireDirection As WireDistributionDirection _
) As IList(Of Curve)
Visual C++
public:
IList<Curve^>^ GetWireCenterlines(
	WireDistributionDirection wireDirection
)
Parameters
wireDirection
Type: Autodesk.Revit.DB.Structure.WireDistributionDirection
 The direction of wire distribution in the Fabric Sheet.
Return Value
 The centerline curves.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FabricSheet Class
GetWireCenterlines Overload
Autodesk.Revit.DB.Structure Namespace